{"format": "layers-model", "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"shape": [256, 72], "dtype": "float32", "name": "dense/kernel"}, {"shape": [72], "dtype": "float32", "name": "dense/bias"}, {"shape": [93, 1024], "dtype": "float32", "name": "lstm/kernel"}, {"shape": [256, 1024], "dtype": "float32", "name": "lstm/recurrent_kernel"}, {"shape": [1024], "dtype": "float32", "name": "lstm/bias"}, {"shape": [72, 1024], "dtype": "float32", "name": "lstm_1/kernel"}, {"shape": [256, 1024], "dtype": "float32", "name": "lstm_1/recurrent_kernel"}, {"shape": [1024], "dtype": "float32", "name": "lstm_1/bias"}]}], "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "training_config": {"metrics": [], "loss_weights": null, "sample_weight_mode": null, "weighted_metrics": null, "optimizer_config": {"config": {"rho": 0.8999999761581421, "epsilon": 1e-07, "name": "RMSprop", "decay": 0.0, "learning_rate": 0.0010000000474974513, "momentum": 0.0, "centered": false}, "class_name": "RMSprop"}, "loss": "categorical_crossentropy"}, "model_config": {"config": {"output_layers": [["dense", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, 93], "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null, 72], "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_2"}, {"config": {"activity_regularizer": null, "recurrent_regularizer": null, "units": 256, "bias_constraint": null, "recurrent_constraint": null, "activation": "tanh", "unroll": false, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "stateful": false, "return_state": true, "recurrent_dropout": 0.0, "time_major": false, "name": "lstm", "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "go_backwards": false, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "implementation": 1, "bias_regularizer": null, "use_bias": true, "return_sequences": false, "trainable": true}, "class_name": "LSTM", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lstm"}, {"config": {"activity_regularizer": null, "recurrent_regularizer": null, "units": 256, "bias_constraint": null, "recurrent_constraint": null, "activation": "tanh", "unroll": false, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "stateful": false, "return_state": true, "recurrent_dropout": 0.0, "time_major": false, "name": "lstm_1", "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "go_backwards": false, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "implementation": 1, "bias_regularizer": null, "use_bias": true, "return_sequences": true, "trainable": true}, "class_name": "LSTM", "inbound_nodes": [[["input_2", 0, 0, {}], ["lstm", 0, 1, {}], ["lstm", 0, 2, {}]]], "name": "lstm_1"}, {"config": {"activity_regularizer": null, "units": 72, "bias_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "name": "dense", "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "name": "dense"}], "name": "model"}, "class_name": "Model"}}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.2.1"}